import hashlib
import random


def generate_meme_name(vertex_id):
    hashed_id = hashlib.sha256(str(vertex_id).encode()).hexdigest()
    part_of_hash = hashed_id[:8]
    adjectives = ["Смешной", "Быстрый", "Шумный", "Магический", "Жареный", "Летающий", "Космический", "Танцующий", "Радужный", "Блестящий", "Спиральный", "Лазерный", "Мистический", "Веселый", "Шутливый", "Безумный", "Энергичный", "Взрывной", "Фантастический", "Чудесный", "Фанковый", "Бесконечный", "Вихревой"]
    nouns = ["паровоз", "вагон", "рельсы", "станция", "магнит", "локомотив", "тупик", "туннель", "перегон", "двигатель", "маршрут", "сигнал", "вираж", "метрополитен", "путник", "путешественник", "проход", "поезд", "ритм", "момент", "взлет", "ритуал", "подвиг", "экспресс", "призрак", "трек", "танец", "маяк", "поворот", "путеводитель"]
    theme1 = f"{random.choice(adjectives)} {random.choice(nouns)}"
    meme_name = f"{theme1}"
    return meme_name


def generate_random_time():
    hour = random.randint(1, 12)
    minute = random.randint(0, 59)
    return f"{hour:02d}:{minute:02d}"